ATsupportum/src/InformationRegisters/НастройкиТранспортаОбменаОбластиДанных/НастройкиТранспортаОбменаОбластиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТранспортаОбменаОбластиДанных</name>
  <comment>Хранит частные настройки транспорта сообщений обмена для каждой области данных.</comment>
  <resources>
    <name>КонечнаяТочкаКорреспондента</name>
    <type>
      <types>ExchangePlanRef.ОбменСообщениями</types>
    </type>
  </resources>
  <resources>
    <name>FILEКаталогОбменаИнформацией</name>
    <comment>Относительный путь к каталогу обмена на сервере или в локальной сети.</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>FTPКаталогОбменаИнформацией</name>
    <comment>Относительный путь к каталогу обмена на FTP-сервере.</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Корреспондент</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/НастройкиТранспортаОбменаОбластейДанных/НастройкиТранспортаОбменаОбластейДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТранспортаОбменаОбластейДанных</name>
  <comment>Хранит общие для всех областей данных настройки транспорта сообщений обмена.</comment>
  <resources>
    <name>FILEКаталогОбменаИнформацией</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>FILEСжиматьФайлИсходящегоСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPСжиматьФайлИсходящегоСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеМаксимальныйДопустимыйРазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПассивноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПуть</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВидТранспортаСообщенийОбменаПоУмолчанию</name>
    <type>
      <types>EnumRef.ВидыТранспортаСообщенийОбмена</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЭлементовВТранзакцииВыгрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЭлементовВТранзакцииЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПарольАрхиваСообщенияОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КонечнаяТочкаКорреспондента</name>
    <type>
      <types>ExchangePlanRef.ОбменСообщениями</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/НастройкиТранспортаОбмена/НастройкиТранспортаОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТранспортаОбмена</name>
  <resources>
    <name>COMАутентификацияОперационнойСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>COMВариантРаботыИнформационнойБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>COMИмяИнформационнойБазыНаСервере1СПредприятия</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>COMИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>COMИмяСервера1СПредприятия</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>COMКаталогИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>COMПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>EMAILМаксимальныйДопустимыйРазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>EMAILСжиматьФайлИсходящегоСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>EMAILУчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </resources>
  <resources>
    <name>FILEКаталогОбменаИнформацией</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>FILEСжиматьФайлИсходящегоСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPСжиматьФайлИсходящегоСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеМаксимальныйДопустимыйРазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПассивноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPСоединениеПуть</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>WSURLВебСервиса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>WSЗапомнитьПароль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>WSИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>165</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>WSИспользоватьПередачуБольшогоОбъемаДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>WSПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидТранспортаСообщенийОбменаПоУмолчанию</name>
    <type>
      <types>EnumRef.ВидыТранспортаСообщенийОбмена</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЭлементовВТранзакцииВыгрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЭлементовВТранзакцииЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПарольАрхиваСообщенияОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/НастройкиТранспортаОбменаОбластиДанных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция АбсолютныйКаталогОбменаИнформацией(Знач Корреспондент) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкиТранспортаОбменаОбластиДанных.FILEКаталогОбменаИнформацией КАК ОтносительныйКаталогОбменаИнформацией,
	|	ЕСТЬNULL(НастройкиТранспортаОбменаОбластейДанных.FILEКаталогОбменаИнформацией, """") КАК ОбщийКаталогОбменаИнформацией
	|ИЗ
	|	РегистрСведений.НастройкиТранспортаОбменаОбластиДанных КАК НастройкиТранспортаОбменаОбластиДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиТранспортаОбменаОбластейДанных КАК НастройкиТранспортаОбменаОбластейДанных
	|		ПО (НастройкиТранспортаОбменаОбластейДанных.КонечнаяТочкаКорреспондента = НастройкиТранспортаОбменаОбластиДанных.КонечнаяТочкаКорреспондента)
	|ГДЕ
	|	НастройкиТранспортаОбменаОбластиДанных.Корреспондент = &Корреспондент";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не заданы настройки подключения для корреспондента ""%1"".'"), Строка(Корреспондент));
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ОбщийКаталогОбменаИнформацией = Выборка.ОбщийКаталогОбменаИнформацией;
	ОтносительныйКаталогОбменаИнформацией = Выборка.ОтносительныйКаталогОбменаИнформацией;
	
	Если ПустаяСтрока(ОбщийКаталогОбменаИнформацией)
		ИЛИ ПустаяСтрока(ОтносительныйКаталогОбменаИнформацией) Тогда
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не заданы настройки подключения для корреспондента ""%1"".'"), Строка(Корреспондент));
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ОбщийКаталогОбменаИнформацией, ОтносительныйКаталогОбменаИнформацией);
КонецФункции

Функция ВидТранспорта(Знач Корреспондент) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(НастройкиТранспортаОбменаОбластейДанных.ВидТранспортаСообщенийОбменаПоУмолчанию, НЕОПРЕДЕЛЕНО) КАК ВидТранспорта
	|ИЗ
	|	РегистрСведений.НастройкиТранспортаОбменаОбластиДанных КАК НастройкиТранспортаОбменаОбластиДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиТранспортаОбменаОбластейДанных КАК НастройкиТранспортаОбменаОбластейДанных
	|		ПО (НастройкиТранспортаОбменаОбластейДанных.КонечнаяТочкаКорреспондента = НастройкиТранспортаОбменаОбластиДанных.КонечнаяТочкаКорреспондента)
	|ГДЕ
	|	НастройкиТранспортаОбменаОбластиДанных.Корреспондент = &Корреспондент";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ВидТранспорта;
КонецФункции

Функция НастройкиТранспорта(Знач Корреспондент) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	"""" КАК FILEКаталогОбменаИнформацией,
	|	"""" КАК FTPСоединениеПуть,
	|
	|	НастройкиТранспортаОбменаОбластиДанных.FILEКаталогОбменаИнформацией КАК FILEОтносительныйКаталогОбменаИнформацией,
	|	НастройкиТранспортаОбменаОбластиДанных.FTPКаталогОбменаИнформацией  КАК FTPОтносительныйКаталогОбменаИнформацией,
	|
	|	НастройкиТранспортаОбменаОбластейДанных.FILEКаталогОбменаИнформацией КАК FILEОбщийКаталогОбменаИнформацией,
	|	НастройкиТранспортаОбменаОбластейДанных.FILEСжиматьФайлИсходящегоСообщения,
	|
	|	НастройкиТранспортаОбменаОбластейДанных.FTPСоединениеПуть КАК FTPОбщийКаталогОбменаИнформацией,
	|	НастройкиТранспортаОбменаОбластейДанных.FTPСжиматьФайлИсходящегоСообщения,
	|	НастройкиТранспортаОбменаОбластейДанных.FTPСоединениеМаксимальныйДопустимыйРазмерСообщения,
	|	НастройкиТранспортаОбменаОбластейДанных.FTPСоединениеПароль,
	|	НастройкиТранспортаОбменаОбластейДанных.FTPСоединениеПассивноеСоединение,
	|	НастройкиТранспортаОбменаОбластейДанных.FTPСоединениеПользователь,
	|	НастройкиТранспортаОбменаОбластейДанных.FTPСоединениеПорт,
	|
	|	НастройкиТранспортаОбменаОбластейДанных.ВидТранспортаСообщенийОбменаПоУмолчанию,
	|	НастройкиТранспортаОбменаОбластейДанных.КоличествоЭлементовВТранзакцииВыгрузкиДанных,
	|	НастройкиТранспортаОбменаОбластейДанных.КоличествоЭлементовВТранзакцииЗагрузкиДанных,
	|	НастройкиТранспортаОбменаОбластейДанных.ПарольАрхиваСообщенияОбмена,
	|	
	|	НастройкиТранспортаОбмена.WSURLВебСервиса,
	|	НастройкиТранспортаОбмена.WSИмяПользователя,
	|	НастройкиТранспортаОбмена.WSПароль
	|	
	|ИЗ
	|	РегистрСведений.НастройкиТранспортаОбменаОбластиДанных КАК НастройкиТранспортаОбменаОбластиДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиТранспортаОбменаОбластейДанных КАК НастройкиТранспортаОбменаОбластейДанных
	|		ПО (НастройкиТранспортаОбменаОбластейДанных.КонечнаяТочкаКорреспондента = НастройкиТранспортаОбменаОбластиДанных.КонечнаяТочкаКорреспондента)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиТранспортаОбмена КАК НастройкиТранспортаОбмена
	|		ПО (НастройкиТранспортаОбмена.Узел = НастройкиТранспортаОбменаОбластиДанных.КонечнаяТочкаКорреспондента)
	|ГДЕ
	|	НастройкиТранспортаОбменаОбластиДанных.Корреспондент = &Корреспондент";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = ОбменДаннымиСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	
	Результат.FILEКаталогОбменаИнформацией = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(
		Результат.FILEОбщийКаталогОбменаИнформацией,
		Результат.FILEОтносительныйКаталогОбменаИнформацией);
	
	Результат.FTPСоединениеПуть = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(
		Результат.FTPОбщийКаталогОбменаИнформацией,
		Результат.FTPОтносительныйКаталогОбменаИнформацией);
	
	Результат.Вставить("ИспользоватьВременныйКаталогДляОтправкиИПриемаСообщений", Истина);
	
	ПараметрыFTP = ОбменДаннымиСервер.FTPИмяСервераИПуть(Результат.FTPСоединениеПуть);
	
	Результат.Вставить("FTPСервер", ПараметрыFTP.Сервер);
	Результат.Вставить("FTPПуть",   ПараметрыFTP.Путь);
	
	Возврат Результат;
КонецФункции

Функция НастройкиТранспортаWS(Знач Корреспондент) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкиТранспортаОбмена.WSURLВебСервиса,
	|	НастройкиТранспортаОбмена.WSИмяПользователя,
	|	НастройкиТранспортаОбмена.WSПароль
	|ИЗ
	|	РегистрСведений.НастройкиТранспортаОбменаОбластиДанных КАК НастройкиТранспортаОбменаОбластиДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиТранспортаОбмена КАК НастройкиТранспортаОбмена
	|		ПО (НастройкиТранспортаОбмена.Узел = НастройкиТранспортаОбменаОбластиДанных.КонечнаяТочкаКорреспондента)
	|ГДЕ
	|	НастройкиТранспортаОбменаОбластиДанных.Корреспондент = &Корреспондент";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Корреспондент", Корреспондент);
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не заданы настройки подключения веб-сервиса для корреспондента %1.'"),
			Строка(Корреспондент));
	КонецЕсли;
	
	Возврат ОбменДаннымиСервер.РезультатЗапросаВСтруктуру(РезультатЗапроса);
КонецФункции

//

// Процедура обновляет запись в регистре по переданным значениям структуры
//
Процедура ОбновитьЗапись(СтруктураЗаписи) Экспорт
	
	ОбменДаннымиСервер.ОбновитьЗаписьВРегистрСведений(СтруктураЗаписи, "НастройкиТранспортаОбменаОбластиДанных");
	
КонецПроцедуры

// Процедура добавляет запись в регистр по переданным значениям структуры
//
Процедура ДобавитьЗапись(СтруктураЗаписи) Экспорт
	
	ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "НастройкиТранспортаОбменаОбластиДанных");
	
КонецПроцедуры

#КонецЕсли
